# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [3]:
regiment=pd.DataFrame(raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [9]:
regiment[regiment['regiment']=='Nighthawks'].preTestScore.mean()

15.25

### Step 5. Present general statistics by company

In [16]:
grouped = regiment.groupby('company')

mean_values = grouped[['preTestScore', 'postTestScore']].mean()
mean_values

         preTestScore  postTestScore
company
1st          6.666667      57.666667
2nd         15.500000      67.000000

### Step 6. What is the mean of each company's preTestScore?

In [17]:
mean_values

         preTestScore  postTestScore
company
1st          6.666667      57.666667
2nd         15.500000      67.000000

### Step 7. Present the mean preTestScores grouped by regiment and company

In [29]:
group2=regiment.groupby(['regiment','company'])
group2.mean()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [34]:
#Hierarchical indexing, also known as multi-level indexing, is a feature in Pandas that allows 
#you to have multiple levels of row or column labels in a DataFrame. This means that you can organize your data
#into a multi-dimensional structure with different levels of indices.

group3=regiment.groupby(['regiment', 'company'])['preTestScore'].mean().reset_index()
group3

     regiment company  preTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

### Step 9. Group the entire dataframe by regiment and company

In [41]:
group2.sum()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st                 7             95
           2nd                55            151
Nighthawks 1st                28            119
           2nd                33            119
Scouts     1st                 5            132
           2nd                 5            132

### Step 10. What is the number of observations in each regiment and company

In [48]:
print("unique companies:",regiment['company'].nunique())
print("unique regiment :",regiment['regiment'].nunique())

unique companies: 2
unique regiment : 3

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [54]:
for name, group_data in group2:
    print("Group Name:", name)
    print("\t\t",group_data)

Group Name: ('Dragoons', '1st')
		    regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25
Group Name: ('Dragoons', '2nd')
		    regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Group Name: ('Nighthawks', '1st')
		      regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
Group Name: ('Nighthawks', '2nd')
		      regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62
Group Name: ('Scouts', '1st')
		   regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70
Group Name: ('Scouts', '2nd')
		    regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70